{
  "title": "AI Flashcards",
  "cards": [
    {
      "front": "In Python, what serves as a 'labeled box' in computer memory to store values?",
      "back": "A variable"
    },
    {
      "front": "What is the core workflow foundation of every computer program?",
      "back": "Input $\\rightarrow$ Process $\\rightarrow$ Output"
    },
    {
      "front": "According to the NASA opening scenario, what specific error caused the loss of the 1999 Mars orbiter?",
      "back": "A data type mismatch (metric vs. imperial units)."
    },
    {
      "front": "Python's ability to guess a variable's data type based on the assigned value is called _____.",
      "back": "Type Inference"
    },
    {
      "front": "Data Type: int",
      "back": "Stores whole numbers without decimals (e.g., 17)."
    },
    {
      "front": "Data Type: float",
      "back": "Stores decimal numbers (e.g., 9.99)."
    },
    {
      "front": "Data Type: string",
      "back": "Stores text such as letters or words wrapped in quotes."
    },
    {
      "front": "What is the memory trick for remembering the definition of an integer (int)?",
      "back": "Integers are INTact (no decimal pieces)."
    },
    {
      "front": "What is the memory trick for remembering the definition of a float?",
      "back": "The decimal point FLOATs."
    },
    {
      "front": "In Python, what is the result of the division operator $/$, such as $10 / 5$?",
      "back": "$2.0$ (it always returns a float)."
    },
    {
      "front": "Which Python operator performs integer division to find how many times a number fits without a remainder?",
      "back": "The $//$ operator."
    },
    {
      "front": "Which Python operator finds the remainder of a division (modulo)?",
      "back": "The $\\%$ operator."
    },
    {
      "front": "How would you calculate the number of 'decades' in an `age` variable using Python operators?",
      "back": "`age // 10`"
    },
    {
      "front": "How would you calculate the 'leftover years' in an `age` variable using Python operators?",
      "back": "`age % 10`"
    },
    {
      "front": "In the function `print(total)`, what is the technical term for `total`?",
      "back": "An argument"
    },
    {
      "front": "What is the output of `print(\"total\")` if the variable `total` equals 100?",
      "back": "The word \"total\""
    },
    {
      "front": "How can you include a single quote inside a string (e.g., Joe's Pizza) without causing a syntax error?",
      "back": "Wrap the string in double quotes (e.g., \"Joe's Pizza\")."
    },
    {
      "front": "What is the term for joining two strings together using the $+$ operator?",
      "back": "Concatenation"
    },
    {
      "front": "What is the result of the string operation `\"Hello\" + \"Sarah\"`?",
      "back": "\"HelloSarah\" (no space)"
    },
    {
      "front": "What data type does the `input()` function always return?",
      "back": "A string"
    },
    {
      "front": "In an `input()` prompt, what does the special character `\\n` do?",
      "back": "It moves the cursor to a new line."
    },
    {
      "front": "Why will `decades = age // 10` fail if `age` comes directly from an `input()` call?",
      "back": "You cannot perform math on a string; the input must be converted to an integer."
    },
    {
      "front": "Function: `int(x)`",
      "back": "Converts a value to an integer."
    },
    {
      "front": "Function: `float(x)`",
      "back": "Converts a value to a decimal number (float)."
    },
    {
      "front": "Function: `str(x)`",
      "back": "Converts a numerical value to a string."
    },
    {
      "front": "When using `print()`, what error occurs if you try to 'glue' (concatenate) a string and an integer directly?",
      "back": "`TypeError` (must convert the integer to a string first)."
    },
    {
      "front": "Define 'AI Hallucination'.",
      "back": "Confident-sounding information generated by an AI that is false, unverifiable, or fabricated."
    },
    {
      "front": "Why does AI hallucinate instead of 'lying' on purpose?",
      "back": "It predicts the most likely next word based on patterns rather than checking facts."
    },
    {
      "front": "In the context of Law and Tech, what was the 'Mata v. Avianca' case outcome?",
      "back": "A lawyer was sanctioned for submitting fake court cases generated by ChatGPT."
    },
    {
      "front": "AI Condition: False Premise",
      "back": "The AI explains a false statement (e.g., 'Why did Lincoln support the internet?') rather than correcting it."
    },
    {
      "front": "AI Condition: Forced Specificity",
      "back": "The AI fabricates exact numbers or dates for poorly documented topics when pressured by a prompt."
    },
    {
      "front": "AI Condition: Fake Citations",
      "back": "The AI generates plausible-looking journal names, authors, or DOIs for studies that do not exist."
    },
    {
      "front": "AI Condition: Long Reasoning",
      "back": "Errors in early steps of a multi-step logic chain compound, leading to a confident but wrong conclusion."
    },
    {
      "front": "Tool: Perplexity",
      "back": "An AI research tool that cites sources, making it more reliable for verification than standard chatbots."
    },
    {
      "front": "Tool: GitHub",
      "back": "A platform where developers store, share, and collaborate on code (described as 'Google Drive for programmers')."
    },
    {
      "front": "Tool: CodeSandbox",
      "back": "A safe online environment used to test and run web applications without affecting a personal computer."
    },
    {
      "front": "What does the 'R' in RAG stand for?",
      "back": "Retrieval (Retrieval-Augmented Generation)."
    },
    {
      "front": "What is the difference between Static AI and RAG AI?",
      "back": "Static AI answers from memory (closed-book); RAG looks up current sources before answering (open-book)."
    },
    {
      "front": "In programming, what is the term for pulling an entire project structure from GitHub into your own workspace?",
      "back": "Cloning"
    },
    {
      "front": "Why is code generally considered more 'trustworthy' than AI output?",
      "back": "Code is a set of exact instructions that are testable and consistent; it does not 'guess' or hallucinate."
    },
    {
      "front": "Which AI evaluation criterion measures if a model sounds sure of itself even when it is factually wrong?",
      "back": "Overconfidence"
    },
    {
      "front": "In the 'Age Calculator' project, why is the `str()` function used in the final step?",
      "back": "To convert the calculated numbers into text so they can be concatenated with the result message."
    },
    {
      "front": "What is the Python output of `print(\"5\" + \"5\")`?",
      "back": "\"55\" (the strings are joined, not added mathematically)."
    },
    {
      "front": "What happens when a programmer attempts to divide by zero in Python?",
      "back": "A 'Division by Zero' error occurs."
    },
    {
      "front": "Which development file usually contains the description of what an application does and instructions for use?",
      "back": "The README file."
    },
    {
      "front": "What specific AI risk involves the invention of plausible-sounding facts about events that haven't happened yet?",
      "back": "Future Facts hallucination (e.g., 'Who won the 2030 World Cup?')."
    },
    {
      "front": "Why is the $+$ operator described as 'glue' in the Python Starter Pack?",
      "back": "It sticks strings together in a sequence."
    },
    {
      "front": "According to the AI Toolbox lesson, what is 'Rule #1' for using AI?",
      "back": "AI can hallucinate."
    },
    {
      "front": "According to the AI Toolbox lesson, what is 'Rule #3' regarding code?",
      "back": "Code doesn't lie—if you can test it, you can trust it."
    },
    {
      "front": "What is the primary purpose of the `print()` function in debugging?",
      "back": "To display the internal values of variables and verify that code is working as expected."
    },
    {
      "front": "How does RAG (Retrieval-Augmented Generation) reduce hallucinations?",
      "back": "By grounding the AI's response in external, cited sources rather than relying solely on training memory."
    },
    {
      "front": "In Python, which character is used to indicate a comment that the computer should ignore?",
      "back": "The `#` (hashtag) symbol."
    },
    {
      "front": "The problem of 'fabrication' in AI refers to what behavior?",
      "back": "The AI making up information that is not based on any real data."
    },
    {
      "front": "What is the memory trick for strings provided in the lesson?",
      "back": "STRING together letters like beads on a string."
    },
    {
      "front": "Which high school course is these materials designed for?",
      "back": "Intro to AI"
    },
    {
      "front": "According to the lesson philosophy, code is a _____ between you and the computer.",
      "back": "Conversation"
    },
    {
      "front": "What happens if you use single quotes for a string that contains a contraction like 'don't'?",
      "back": "Python thinks the string ends at the second single quote, causing an error."
    },
    {
      "front": "What does the 'Failure to say I don't know' refer to in AI research?",
      "back": "When a model provides a fake answer instead of refusing a prompt it cannot truthfully answer."
    },
    {
      "front": "In the context of medical AI, why is hallucination particularly dangerous?",
      "back": "Wrong information can lead to patient harm."
    },
    {
      "front": "Identify the error: `name = \"Alice`",
      "back": "Missing closing quote (Quote Confusion)."
    },
    {
      "front": "What is the result of `17 // 5` in Python?",
      "back": "3"
    },
    {
      "front": "What is the result of `17 % 5` in Python?",
      "back": "2"
    },
    {
      "front": "What is the purpose of the 'Repo Scavenger Hunt' mentioned in the source?",
      "back": "To help students navigate a code repository and identify key files like the homepage or README."
    },
    {
      "front": "Which AI tool is explicitly recommended for research because it cites sources?",
      "back": "Perplexity"
    }
  ]
}